<?php
use yii\helpers\Html;
?>

<p>Ви вказали наступну інформацію:</p>


<!--Виклик методу Html::encode. -->
<!--Цей метод використовується для екранування (encode) значення, що виводиться, з метою захисту від XSS-атак (впровадження шкідливого коду). -->
<!--Це важливо для безпеки додатку оскільки запобігає виконанню шкідливого HTML або JavaScript коду.-->


<ul>
    <li><label>Ім’я</label>: <?= Html::encode($model->name) ?></li>
    <li><label>Адреса електронної пошти</label>: <?= Html::encode($model->email) ?></li>
</ul>